InformationRegisters/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пустой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаОткрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаОтгрузкиНакладных/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ; 
		Если Документ.Проведен тогда
		   СостояниеДокумента = 1;
		ИначеЕсли Документ.ПометкаУдаления тогда
		   СостояниеДокумента = 2;
        КонецЕсли;
		ЗаполнитьСписокНакладныхДокументу();
		ЗаполнитьТаблицу();
		Элементы.ГруппаДокумент.Видимость = Истина; 
		Элементы.ГруппаДокументПодвал.Видимость = Истина; 
		Элементы.ТаблицаВыбора.КоманднаяПанель.Видимость = Ложь;
		Элементы.ТаблицаВыбораВкл.Видимость = Ложь;    
		Ломбард = Документ.Ломбард; 
		Инкассатор = Документ.Инкассатор;
		Получатель = Документ.Получатель;
		СкладПолучатель = Документ.СкладПолучатель;
		Элементы.Ломбард.ТолькоПросмотр = Истина;
		Элементы.Инкассатор.ТолькоПросмотр = Истина;  
		Элементы.Получатель.ТолькоПросмотр = Истина;
		ЭтаФорма.Заголовок = Метаданные.Документы.ЛБ_КорректировкаНакладной.Синоним + ": " + Строка(Документ.ВидОперации);
	Иначе
		Если Параметры.Свойство("Организация") Тогда
			Организация = Параметры.Организация; 
		КонецЕсли;	
		Если Параметры.Свойство("Ломбард") Тогда
			Ломбард = Параметры.Ломбард; 
			ОтделениеЛомбарда = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДатаСеанса(), Ломбард); 
		КонецЕсли; 
		Получатель = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
		Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
			СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
		КонецЕсли;	
		ЭтаФорма.Заголовок = "Отгрузка накладных";
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов() 
	МассивС = Новый Массив;
	Если Получатель = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда  
		МассивС.Добавить(ЛБ_Общиймодуль.ПолучитьСклад(Получатель, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО));   
	Иначе	
	    МассивС.Добавить(ЛБ_Общиймодуль.ПолучитьСклад(Получатель, Перечисления.ЛБ_ВидыСкладов.Залоги)); 
	КонецЕсли;
	Возврат МассивС; 
КонецФункции	


&НаСервере
Процедура ЗаполнитьСписокНакладныхДокументу()
	СписокНакладных.Очистить();
	Для каждого стр Из Документ.ЗалоговыеБилеты Цикл 
		Если СписокНакладных.НайтиПоЗначению(Стр.НакладнаяНаОтгрузку) = неопределено Тогда 
			СписокНакладных.Добавить(Стр.НакладнаяНаОтгрузку);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНакладные(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ПараметрыФормы.Вставить("Ломбард", Ломбард); 
	ПараметрыФормы.Вставить("ВидОперации", 0);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораНакладных", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборНакладных", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Список", СписокНакладных); 
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата-1, ТекущаяДатаСеанса()));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИСТИНА КАК Вкл,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток КАК КоличествоИзделий,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток КАК ВесИзделий,
	               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток КАК СуммаОценки,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Период КАК ДатаСумкаЗакрыта,
	               |	ЗНАЧЕНИЕ(Перечисление.ЛБ_статусыНакладнойНаОтгрузку.Отгружена) КАК СтатусНакладнойНовый
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку В (&Список)) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(&Дата, ) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки
	               |		ПО (ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку = ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку)
	               |ГДЕ
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта)"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	//Если НЕ ЗначениеЗаполнено(Документ) Тогда 
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	//	               |ИЗ
	//	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(, НакладнаяНаОтгрузку В (&Список)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	//	               |ГДЕ
	//	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)";
	//	ТаблицаСтатусовВНакладной = Запрос.Выполнить().Выгрузить();  
	//	
	//	Для каждого СтрЗ Из ТаблицаЗапроса Цикл 
	//		Для каждого Стр Из СтрЗ.НакладнаяНаОтгрузку.Залоги Цикл
	//			Отбор = Новый Структура;
	//			Отбор.Вставить("НакладнаяНаОтгрузку", СтрЗ.НакладнаяНаОтгрузку);
	//			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
	//			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
	//			
	//			Строки = ТаблицаСтатусовВНакладной.НайтиСтроки(Отбор); 
	//			Если НЕ Строки.Количество() = 0 тогда
	//				СтрЗ.КоличествоИзделий = СтрЗ.КоличествоИзделий - Стр.Количество;  
	//				СтрЗ.ВесИзделий = СтрЗ.ВесИзделий - Стр.Вес;
	//				СтрЗ.СуммаОценки = СтрЗ.СуммаОценки - Стр.СуммаОценки;
	//			КонецЕсли	
	//		Конеццикла;	
	//	КонецЦикла;
	//Иначе  
	Если ЗначениеЗаполнено(Документ) Тогда
		ТаблицаЗапроса.ЗаполнитьЗначения(Перечисления.ЛБ_статусыНакладнойНаОтгрузку.ПустаяСсылка(), "СтатусНакладнойНовый");
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной КАК СтатусНакладной
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
		               |ГДЕ
		               |	ЛБ_СтатусыНакладнойНаОтгрузку.Регистратор = &Регистратор";  
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("НакладнаяНаОтгрузку", Выборка.НакладнаяНаОтгрузку);
			строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Для каждого Стр Из Строки Цикл
				Стр.СтатусНакладнойНовый = Выборка.СтатусНакладной;
            Конеццикла;
		КонецЦикла;	
	КонецЕсли;	

	ТаблицаВыбора.Загрузить(ТаблицаЗапроса);     
                                                          
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораНакладных(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли; 
	
	СписокНакладных = Результат; 
	ЗаполнитьТаблицу();  
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтгрузку(Команда) 
	СписокНакладныхДляОтгрузки = Новый СписокЗначений;  
	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда 
			СписокНакладныхДляОтгрузки.Добавить(Стр.НакладнаяНаОтгрузку);
		КонецЕсли;	
	КонецЦикла;	            
	Если СписокНакладныхДляОтгрузки.Количество() = 0 Тогда
		Предупреждение("Не выбраны накладные для отмены отгрузки.", 60);  
	ИначеЕсли НЕ ЗначениеЗаполнено(Инкассатор) Тогда
		Предупреждение("Не выбран инкассатор.", 60); 
	ИначеЕсли НЕ ЗначениеЗаполнено(Получатель) Тогда
		Предупреждение("Не выбран получатель.", 60); 	
	ИначеЕсли НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		Предупреждение("Не выбран склад-получатель.", 60); 		
	Иначе     
		СтруктураВ = Новый структура;
		СтруктураВ.Вставить("СписокНакладных", СписокНакладныхДляОтгрузки);
		СтруктураВ.Вставить("Ломбард", Ломбард);
		СтруктураВ.Вставить("Инкассатор", Инкассатор);
		СтруктураВ.Вставить("Получатель", Получатель); 
		СтруктураВ.Вставить("СкладПолучатель", СкладПолучатель);
		Закрыть(СтруктураВ);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Функция ПолучитьЛомбардыОтделения() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(ТекущаяДатаСеанса(), ОтделениеЛомбарда, Ломбард); 
КонецФункции

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь; 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПолучателя",ЭтаФорма);
    Если ЗначениеЗаполнено(ОтделениеЛомбарда) Тогда 
		СписокВыбора = ПолучитьЛомбардыОтделения();  
		СписокВыбора.Вставить(0, ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Ломбард); 

		Если ВыбранноеЗначение <> Неопределено Тогда 
		   Получатель = ВыбранноеЗначение.Значение; 
		   Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		   Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
			   СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
		   КонецЕсли;
		КонецЕсли;  
	Иначе	 
	    ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры    
	
&НаСервере
Процедура ПослеВыбораПолучателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	Получатель = Результат; 
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
    Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
	   СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьОтделениеЛомбарда()  
	Возврат ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДатаСеанса(), Ломбард);
КонецФункции

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	ОтделениеЛомбарда = ПолучитьОтделениеЛомбарда(); 
КонецПроцедуры
